---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.DuplicatePoints
source: html/fcc40b7f-3740-f797-0fcb-a22bd2b98bcd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.DuplicatePoints Property

There are identical points in the same place. Lines created from points may not work as expected.

## Syntax (C#)
```csharp
public static FailureDefinitionId DuplicatePoints { get; }
```